{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 272,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Entrega I cadeira Web-semantica @ Fcul 2020-2021\n",
    "# Realizado por João Pinto(55018) e Ricardo Meireles(xxxxx) "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 273,
   "metadata": {},
   "outputs": [],
   "source": [
    "import csv\n",
    "import rdflib\n",
    "from rdflib import Graph, Literal, Namespace, URIRef, BNode\n",
    "from rdflib.namespace import DCTERMS, RDF, RDFS\n",
    "from urllib.parse import quote\n",
    "\n",
    "NFL = Namespace('http://www.nfl.com/')\n",
    "\n",
    "dados_base = csv.DictReader(open(\"Basic_Stats.csv\"))\n",
    "dados_passing = csv.DictReader(open(\"Career_Stats_Passing.csv\"))\n",
    "\n",
    "dados = Graph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 274,
   "metadata": {},
   "outputs": [],
   "source": [
    "for row in dados_base:\n",
    "    \n",
    "    id =row['Player Id'] \n",
    "    \n",
    "    player = URIRef(NFL+id)\n",
    "    current_team = URIRef(NFL+quote(row['Current Team']))\n",
    "    name = URIRef(NFL+quote(row['Name']))\n",
    "    position = URIRef(NFL+quote(row['Position']))\n",
    "    player_number = Literal(row['Number'],datatype=XSD.int)\n",
    "    current_status = URIRef(NFL+quote(row['Current Status']))\n",
    "    experience = Literal(row['Experience'])\n",
    "    birth_place = URIRef(NFL+quote(row['Birth Place']))\n",
    "    college = URIRef(NFL+quote(row['College']))\n",
    "    high_school = URIRef(NFL+quote(row['High School']))\n",
    "    high_school_location = URIRef(NFL+quote(row['High School Location']))\n",
    "    height = Literal(row['Height (inches)'],datatype=XSD.int)\n",
    "    weight = Literal(row['Weight (lbs)'],datatype=XSD.int)\n",
    "    years_played = Literal(row['Years Played'])\n",
    "    age = Literal(row['Age'],datatype=XSD.int)\n",
    "    dados.add((player, RDF.type, NFL.player))\n",
    "    dados.add((player, RDFS.label, Literal(id, lang=\"en\")))\n",
    "    \n",
    "\n",
    "    dados.add((player, NFL.name, name ))  \n",
    "    dados.add((player, NFL.current_team, current_team))\n",
    "    dados.add((player, NFL.position, position))\n",
    "    dados.add((player, NFL.player_number, player_number))\n",
    "    dados.add((player, NFL.current_status, current_status))\n",
    "    dados.add((player, NFL.experience, experience))\n",
    "    dados.add((player, NFL.birth_place, birth_place))\n",
    "    dados.add((player, NFL.college, college))\n",
    "    dados.add((player, NFL.high_school, NFL.high_school))\n",
    "    dados.add((player, NFL.high_school_location, high_school_location)) \n",
    "    dados.add((player, NFL.height, height))\n",
    "    dados.add((player, NFL.weight, weight))\n",
    "    dados.add((player, NFL.years_played, years_played))\n",
    "    \n",
    "    \n",
    "   "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 275,
   "metadata": {},
   "outputs": [],
   "source": [
    "for row in dados_passing:\n",
    "    \n",
    "    id =row['Player Id'] \n",
    "    \n",
    "    player = URIRef(NFL+id)\n",
    "    \n",
    "    year = URIRef(NFL+quote(row['Year']))\n",
    "    \n",
    "    stat_year = BNode()\n",
    "    player_stat = BNode() \n",
    "    \n",
    "    team = URIRef(NFL+quote(row['Team']))\n",
    "    games_played = Literal(row['Games Played'])\n",
    "    passes_attempted = Literal(row['Passes Attempted'])\n",
    "    passes_completed = Literal(row['Passes Completed'])\n",
    "    completion_percentage = Literal(row['Completion Percentage'])\n",
    "    pass_att_per_game = Literal(row['Pass Attempts Per Game'])\n",
    "    passing_yards = Literal(row['Passing Yards'])\n",
    "    \n",
    "    passing_yards_att = Literal(row['Passing Yards Per Attempt'])\n",
    "    passing_yards_game = Literal(row['Passing Yards Per Game'])\n",
    "    td_passes = Literal(row['TD Passes'])\n",
    "    percentage_tds_per_attemp = Literal(row['Percentage of TDs per Attempts'])\n",
    "    \n",
    "    interceptions = Literal(row['Ints'])\n",
    "    interceptions_rate = Literal(row['Ints'])\n",
    "    longest_pass = Literal(row['Longest Pass'])\n",
    "    passes_longer_20yards = Literal(row['Passes Longer than 20 Yards'])\n",
    "    \n",
    "    passes_longer_40yards = Literal(row['Passes Longer than 40 Yards'])\n",
    "    sacks = Literal(row['Sacks'])\n",
    "    sacked_yards_lost = Literal(row['Sacked Yards Lost'])\n",
    "    passer_rating = Literal(row['Passer Rating'])\n",
    "    \n",
    "    dados.add((player, NFL.player_stat, player_stat ))  \n",
    "    dados.add((player_stat, year, stat_year ))\n",
    "    \n",
    "    dados.add((stat_year,NFL.team,team))\n",
    "    dados.add((stat_year,NFL.games_played,games_played))\n",
    "    dados.add((stat_year,NFL.passes_attempted,passes_attempted))\n",
    "    dados.add((stat_year,NFL.passes_completed,passes_completed))\n",
    "    dados.add((stat_year,NFL.completion_percentage,completion_percentage))\n",
    "    dados.add((stat_year,NFL.pass_att_per_game,pass_att_per_game))\n",
    "    dados.add((stat_year,NFL.passing_yards,passing_yards))\n",
    "    \n",
    "    dados.add((stat_year,NFL.passing_yards_att,passing_yards_att))\n",
    "    dados.add((stat_year,NFL.passing_yards_game,passing_yards_game))\n",
    "    dados.add((stat_year,NFL.td_passes,td_passes))\n",
    "    dados.add((stat_year,NFL.percentage_tds_per_attemp,percentage_tds_per_attemp))\n",
    "    \n",
    "    dados.add((stat_year,NFL.interceptions,interceptions))\n",
    "    dados.add((stat_year,NFL.interceptions_rate,interceptions_rate))\n",
    "    dados.add((stat_year,NFL.longest_pass,longest_pass))\n",
    "    dados.add((stat_year,NFL.passes_longer_20yards,passes_longer_20yards))\n",
    "    \n",
    "    dados.add((stat_year,NFL.passes_longer_40yards,passes_longer_40yards))\n",
    "    dados.add((stat_year,NFL.sacks,sacks))\n",
    "    dados.add((stat_year,NFL.sacked_yards_lost,sacked_yards_lost))\n",
    "    dados.add((stat_year,NFL.passer_rating,passer_rating))\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 276,
   "metadata": {},
   "outputs": [],
   "source": [
    "dados.bind(\"NFL\",NFL)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 277,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "IOPub data rate exceeded.\n",
      "The notebook server will temporarily stop sending output\n",
      "to the client in order to avoid crashing it.\n",
      "To change this limit, set the config variable\n",
      "`--NotebookApp.iopub_data_rate_limit`.\n",
      "\n",
      "Current values:\n",
      "NotebookApp.iopub_data_rate_limit=1000000.0 (bytes/sec)\n",
      "NotebookApp.rate_limit_window=3.0 (secs)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "print(dados.serialize(format=\"turtle\").decode(\"utf-8\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 286,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Name: http://www.nfl.com/Bercovici%2C%20Mike\n",
      "Name: http://www.nfl.com/Tanney%2C%20Alex\n",
      "Name: http://www.nfl.com/Trubisky%2C%20Mitchell\n",
      "Name: http://www.nfl.com/Moore%2C%20Matt\n",
      "Name: http://www.nfl.com/Johnson%2C%20Josh\n",
      "Name: http://www.nfl.com/Kessler%2C%20Cody\n",
      "Name: http://www.nfl.com/Morris%2C%20Stephen\n",
      "Name: http://www.nfl.com/Mullens%2C%20Nick\n",
      "Name: http://www.nfl.com/Bridgewater%2C%20Teddy\n",
      "Name: http://www.nfl.com/Siemian%2C%20Trevor\n",
      "Name: http://www.nfl.com/Conque%2C%20Zach\n",
      "Name: http://www.nfl.com/Dalton%2C%20Andy\n",
      "Name: http://www.nfl.com/Kaepernick%2C%20Colin\n",
      "Name: http://www.nfl.com/Jenkins%2C%20Eli\n",
      "Name: http://www.nfl.com/Grayson%2C%20Garrett\n",
      "Name: http://www.nfl.com/Ryan%2C%20Matt\n",
      "Name: http://www.nfl.com/Tolzien%2C%20Scott\n",
      "Name: http://www.nfl.com/Walker%2C%20Phillip\n",
      "Name: http://www.nfl.com/Prescott%2C%20Dak\n",
      "Name: http://www.nfl.com/Showers%2C%20Jameill\n",
      "Name: http://www.nfl.com/Luck%2C%20Andrew\n",
      "Name: http://www.nfl.com/Davis%2C%20Austin\n",
      "Name: http://www.nfl.com/Schaub%2C%20Matt\n",
      "Name: http://www.nfl.com/Roethlisberger%2C%20Ben\n",
      "Name: http://www.nfl.com/Gabbert%2C%20Blaine\n",
      "Name: http://www.nfl.com/Tannehill%2C%20Ryan\n",
      "Name: http://www.nfl.com/Weeden%2C%20Brandon\n",
      "Name: http://www.nfl.com/Orlovsky%2C%20Dan\n",
      "Name: http://www.nfl.com/Gilbert%2C%20Garrett\n",
      "Name: http://www.nfl.com/Hill%2C%20Shaun\n",
      "Name: http://www.nfl.com/Sloter%2C%20Kyle\n",
      "Name: http://www.nfl.com/Allen%2C%20Brandon\n",
      "Name: http://www.nfl.com/Shaw%2C%20Connor\n",
      "Name: http://www.nfl.com/Jones%2C%20Cardale\n",
      "Name: http://www.nfl.com/Sudfeld%2C%20Nate\n",
      "Name: http://www.nfl.com/Webb%2C%20Joe\n",
      "Name: http://www.nfl.com/Bray%2C%20Tyler\n",
      "Name: http://www.nfl.com/Ponder%2C%20Christian\n",
      "Name: http://www.nfl.com/Wentz%2C%20Carson\n",
      "Name: http://www.nfl.com/Petty%2C%20Bryce\n",
      "Name: http://www.nfl.com/Houston%2C%20Bart\n",
      "Name: http://www.nfl.com/Savage%2C%20Tom\n",
      "Name: http://www.nfl.com/Brees%2C%20Drew\n",
      "Name: http://www.nfl.com/Moore%2C%20Kellen\n",
      "Name: http://www.nfl.com/Bortles%2C%20Blake\n",
      "Name: http://www.nfl.com/Webb%2C%20Davis\n",
      "Name: http://www.nfl.com/Knight%2C%20Trevor\n",
      "Name: http://www.nfl.com/Newton%2C%20Cam\n",
      "Name: http://www.nfl.com/Barkley%2C%20Matt\n",
      "Name: http://www.nfl.com/Garoppolo%2C%20Jimmy\n"
     ]
    }
   ],
   "source": [
    "#query 1 -> Nome de todos os jogadores cuja posiçao é Quarterback\n",
    "qres = dados.query(\n",
    "    \"\"\"SELECT ?name\n",
    "       WHERE {\n",
    "          ?p a NFL:player .\n",
    "          ?p NFL:name ?name .\n",
    "          ?p NFL:position NFL:QB .\n",
    "       }LIMIT 50\"\"\")\n",
    "\n",
    "for row in qres:\n",
    "    print(\"Name: %s\" % row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 308,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Name: http://www.nfl.com/Bercovici%2C%20Mike Team: http://www.nfl.com/Los%20Angeles%20Chargers\n",
      "Name: http://www.nfl.com/Tanney%2C%20Alex Team: http://www.nfl.com/Tennessee%20Titans\n",
      "Name: http://www.nfl.com/Trubisky%2C%20Mitchell Team: http://www.nfl.com/Chicago%20Bears\n",
      "Name: http://www.nfl.com/Moore%2C%20Matt Team: http://www.nfl.com/Miami%20Dolphins\n",
      "Name: http://www.nfl.com/Johnson%2C%20Josh Team: http://www.nfl.com/New%20York%20Giants\n",
      "Name: http://www.nfl.com/Kessler%2C%20Cody Team: http://www.nfl.com/Cleveland%20Browns\n",
      "Name: http://www.nfl.com/Morris%2C%20Stephen Team: http://www.nfl.com/Indianapolis%20Colts\n",
      "Name: http://www.nfl.com/Mullens%2C%20Nick Team: http://www.nfl.com/San%20Francisco%2049ers\n",
      "Name: http://www.nfl.com/Bridgewater%2C%20Teddy Team: http://www.nfl.com/Minnesota%20Vikings\n",
      "Name: http://www.nfl.com/Siemian%2C%20Trevor Team: http://www.nfl.com/Denver%20Broncos\n",
      "Name: http://www.nfl.com/Conque%2C%20Zach Team: http://www.nfl.com/Houston%20Texans\n",
      "Name: http://www.nfl.com/Dalton%2C%20Andy Team: http://www.nfl.com/Cincinnati%20Bengals\n",
      "Name: http://www.nfl.com/Kaepernick%2C%20Colin Team: http://www.nfl.com/San%20Francisco%2049ers\n",
      "Name: http://www.nfl.com/Jenkins%2C%20Eli Team: http://www.nfl.com/Los%20Angeles%20Chargers\n",
      "Name: http://www.nfl.com/Grayson%2C%20Garrett Team: http://www.nfl.com/New%20Orleans%20Saints\n",
      "Name: http://www.nfl.com/Ryan%2C%20Matt Team: http://www.nfl.com/Atlanta%20Falcons\n",
      "Name: http://www.nfl.com/Tolzien%2C%20Scott Team: http://www.nfl.com/Indianapolis%20Colts\n",
      "Name: http://www.nfl.com/Walker%2C%20Phillip Team: http://www.nfl.com/Indianapolis%20Colts\n",
      "Name: http://www.nfl.com/Prescott%2C%20Dak Team: http://www.nfl.com/Dallas%20Cowboys\n",
      "Name: http://www.nfl.com/Showers%2C%20Jameill Team: http://www.nfl.com/Dallas%20Cowboys\n",
      "Name: http://www.nfl.com/Luck%2C%20Andrew Team: http://www.nfl.com/Indianapolis%20Colts\n",
      "Name: http://www.nfl.com/Davis%2C%20Austin Team: http://www.nfl.com/Seattle%20Seahawks\n",
      "Name: http://www.nfl.com/Schaub%2C%20Matt Team: http://www.nfl.com/Atlanta%20Falcons\n",
      "Name: http://www.nfl.com/Roethlisberger%2C%20Ben Team: http://www.nfl.com/Pittsburgh%20Steelers\n",
      "Name: http://www.nfl.com/Gabbert%2C%20Blaine Team: http://www.nfl.com/Arizona%20Cardinals\n",
      "Name: http://www.nfl.com/Tannehill%2C%20Ryan Team: http://www.nfl.com/Miami%20Dolphins\n",
      "Name: http://www.nfl.com/Weeden%2C%20Brandon Team: http://www.nfl.com/Houston%20Texans\n",
      "Name: http://www.nfl.com/Orlovsky%2C%20Dan Team: http://www.nfl.com/Detroit%20Lions\n",
      "Name: http://www.nfl.com/Gilbert%2C%20Garrett Team: http://www.nfl.com/Carolina%20Panthers\n",
      "Name: http://www.nfl.com/Hill%2C%20Shaun Team: http://www.nfl.com/Minnesota%20Vikings\n",
      "Name: http://www.nfl.com/Sloter%2C%20Kyle Team: http://www.nfl.com/Denver%20Broncos\n",
      "Name: http://www.nfl.com/Allen%2C%20Brandon Team: http://www.nfl.com/Jacksonville%20Jaguars\n",
      "Name: http://www.nfl.com/Shaw%2C%20Connor Team: http://www.nfl.com/Chicago%20Bears\n",
      "Name: http://www.nfl.com/Jones%2C%20Cardale Team: http://www.nfl.com/Buffalo%20Bills\n",
      "Name: http://www.nfl.com/Sudfeld%2C%20Nate Team: http://www.nfl.com/Washington%20Redskins\n",
      "Name: http://www.nfl.com/Webb%2C%20Joe Team: http://www.nfl.com/Carolina%20Panthers\n",
      "Name: http://www.nfl.com/Bray%2C%20Tyler Team: http://www.nfl.com/Kansas%20City%20Chiefs\n",
      "Name: http://www.nfl.com/Ponder%2C%20Christian Team: http://www.nfl.com/San%20Francisco%2049ers\n",
      "Name: http://www.nfl.com/Wentz%2C%20Carson Team: http://www.nfl.com/Philadelphia%20Eagles\n",
      "Name: http://www.nfl.com/Petty%2C%20Bryce Team: http://www.nfl.com/New%20York%20Jets\n",
      "Name: http://www.nfl.com/Houston%2C%20Bart Team: http://www.nfl.com/Pittsburgh%20Steelers\n",
      "Name: http://www.nfl.com/Savage%2C%20Tom Team: http://www.nfl.com/Houston%20Texans\n",
      "Name: http://www.nfl.com/Brees%2C%20Drew Team: http://www.nfl.com/New%20Orleans%20Saints\n",
      "Name: http://www.nfl.com/Moore%2C%20Kellen Team: http://www.nfl.com/Dallas%20Cowboys\n",
      "Name: http://www.nfl.com/Bortles%2C%20Blake Team: http://www.nfl.com/Jacksonville%20Jaguars\n",
      "Name: http://www.nfl.com/Webb%2C%20Davis Team: http://www.nfl.com/New%20York%20Giants\n",
      "Name: http://www.nfl.com/Knight%2C%20Trevor Team: http://www.nfl.com/Arizona%20Cardinals\n",
      "Name: http://www.nfl.com/Newton%2C%20Cam Team: http://www.nfl.com/Carolina%20Panthers\n",
      "Name: http://www.nfl.com/Barkley%2C%20Matt Team: http://www.nfl.com/San%20Francisco%2049ers\n",
      "Name: http://www.nfl.com/Garoppolo%2C%20Jimmy Team: http://www.nfl.com/New%20England%20Patriots\n"
     ]
    }
   ],
   "source": [
    "#query 1 -> Nome e equipa de todos os jogadores cuja posiçao é Quarterback\n",
    "qres = dados.query(\n",
    "    \"\"\"SELECT ?name ?equipa\n",
    "       WHERE {\n",
    "          ?p a NFL:player .\n",
    "          ?p NFL:name ?name .\n",
    "          ?p NFL:current_team ?equipa .\n",
    "          ?p NFL:position NFL:QB .\n",
    "       }LIMIT 50\"\"\")\n",
    "\n",
    "for row in qres:\n",
    "    print(\"Name: %s Team: %s\" % row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 325,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Name: http://www.nfl.com/Cavosie%2C%20John\n",
      "Name: http://www.nfl.com/Ned%2C%20Derrick\n",
      "Name: http://www.nfl.com/Bell%2C%20Josh\n",
      "Name: http://www.nfl.com/Baldwin%2C%20Jack\n",
      "Name: http://www.nfl.com/Babinecz%2C%20John\n",
      "Name: http://www.nfl.com/Adkins%2C%20Bob\n",
      "Name: http://www.nfl.com/Finau%2C%20Tevita\n",
      "Name: http://www.nfl.com/Thompson%2C%20David\n",
      "Name: http://www.nfl.com/Andrews%2C%20Tom\n",
      "Name: http://www.nfl.com/Pape%2C%20Oran\n",
      "Name: http://www.nfl.com/Kelly%2C%20Ben\n",
      "Name: http://www.nfl.com/Wheeler%2C%20Cowboy\n",
      "Name: http://www.nfl.com/Kinderdine%2C%20Walt\n",
      "Name: http://www.nfl.com/West%2C%20Bob\n",
      "Name: http://www.nfl.com/Risley%2C%20Elliot\n",
      "Name: http://www.nfl.com/Latsko%2C%20Billy\n",
      "Name: http://www.nfl.com/Shaw%2C%20Ed\n",
      "Name: http://www.nfl.com/Johnson%2C%20Ray\n",
      "Name: http://www.nfl.com/Nash%2C%20Marcus\n",
      "Name: http://www.nfl.com/Kinderman%2C%20Keith\n",
      "Name: http://www.nfl.com/Carroll%2C%20Wesley\n",
      "Name: http://www.nfl.com/Margarita%2C%20Bob\n",
      "Name: http://www.nfl.com/Matuza%2C%20Al\n",
      "Name: http://www.nfl.com/Harris%2C%20Rod\n",
      "Name: http://www.nfl.com/Kimbrough%2C%20John\n",
      "Name: http://www.nfl.com/Kors%2C%20R.J.\n",
      "Name: http://www.nfl.com/Reed%2C%20Tyler\n",
      "Name: http://www.nfl.com/Haslerig%2C%20Clint\n",
      "Name: http://www.nfl.com/Mady%2C%20Lamar\n",
      "Name: http://www.nfl.com/King%2C%20Bruce\n",
      "Name: http://www.nfl.com/Bawel%2C%20Bibbles\n",
      "Name: http://www.nfl.com/Penn%2C%20Jesse\n",
      "Name: http://www.nfl.com/Carson%2C%20Howie\n",
      "Name: http://www.nfl.com/Schwartz%2C%20Elmer\n",
      "Name: http://www.nfl.com/Maitland%2C%20Jack\n",
      "Name: http://www.nfl.com/Thomas%2C%20Lee\n",
      "Name: http://www.nfl.com/Davis%2C%20Paul\n",
      "Name: http://www.nfl.com/Calico%2C%20Tyrone\n",
      "Name: http://www.nfl.com/Gales%2C%20Dion\n",
      "Name: http://www.nfl.com/Wallace%2C%20Rodney\n",
      "Name: http://www.nfl.com/Carter%2C%20Kerry\n",
      "Name: http://www.nfl.com/Keathley%2C%20Michael\n",
      "Name: http://www.nfl.com/Malone%2C%20Darrell\n",
      "Name: http://www.nfl.com/Larsen%2C%20Leif\n",
      "Name: http://www.nfl.com/Harper%2C%20Shawn\n",
      "Name: http://www.nfl.com/Wheat%2C%20Warren\n",
      "Name: http://www.nfl.com/Oden%2C%20Derrick\n",
      "Name: http://www.nfl.com/Barlow%2C%20Corey\n",
      "Name: http://www.nfl.com/Taylor%2C%20Jim\n",
      "Name: http://www.nfl.com/Aiyewa%2C%20Victor\n"
     ]
    }
   ],
   "source": [
    "#query 2 -> Nome de todos os jogadores que tenham jogado exactamente 3 epocas\n",
    "qres = dados.query(\n",
    "    \"\"\"SELECT ?name \n",
    "       WHERE {\n",
    "          ?p a NFL:player .\n",
    "          ?p NFL:name ?name .\n",
    "          ?p NFL:experience '3 Seasons' .\n",
    "       }LIMIT 50\"\"\")\n",
    "\n",
    "for row in qres:\n",
    "    print(\"Name: %s\" % row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 328,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Name: http://www.nfl.com/Peoples%2C%20Corey Weight 212\n",
      "Name: http://www.nfl.com/DeFrance%2C%20Chris Weight 205\n",
      "Name: http://www.nfl.com/Watts%2C%20Robert Weight 218\n",
      "Name: http://www.nfl.com/Maddox%2C%20Tommy Weight 219\n",
      "Name: http://www.nfl.com/Mixon%2C%20Joe Weight 226\n",
      "Name: http://www.nfl.com/Carter%2C%20Joe Weight 201\n",
      "Name: http://www.nfl.com/Robinson%2C%20Corey Weight 317\n",
      "Name: http://www.nfl.com/Smith%2C%20Chris Weight 262\n",
      "Name: http://www.nfl.com/Green%2C%20A.J. Weight 210\n",
      "Name: http://www.nfl.com/Lee%2C%20Danzell Weight 235\n",
      "Name: http://www.nfl.com/Hanna%2C%20Zip Weight 218\n",
      "Name: http://www.nfl.com/Del%20Greco%2C%20Al Weight 202\n",
      "Name: http://www.nfl.com/Patton%2C%20Cliff Weight 243\n",
      "Name: http://www.nfl.com/Albright%2C%20Ethan Weight 260\n",
      "Name: http://www.nfl.com/Papach%2C%20George Weight 208\n",
      "Name: http://www.nfl.com/Ogunjobi%2C%20Larry Weight 304\n",
      "Name: http://www.nfl.com/Daniels%2C%20DaVaris Weight 201\n",
      "Name: http://www.nfl.com/McCaffrey%2C%20Mike Weight 235\n",
      "Name: http://www.nfl.com/Hall%2C%20Shane Weight 305\n",
      "Name: http://www.nfl.com/Jackson%2C%20Chris Weight 202\n",
      "Name: http://www.nfl.com/Ginn%2C%20Tommie Weight 253\n",
      "Name: http://www.nfl.com/Lindell%2C%20Rian Weight 227\n",
      "Name: http://www.nfl.com/Rhodes%2C%20Dominic Weight 203\n",
      "Name: http://www.nfl.com/Schindler%2C%20Steve Weight 256\n",
      "Name: http://www.nfl.com/Bell%2C%20Kahlil Weight 219\n",
      "Name: http://www.nfl.com/Rice%2C%20George Weight 260\n",
      "Name: http://www.nfl.com/Baston%2C%20Jaron Weight 305\n",
      "Name: http://www.nfl.com/DeRiggi%2C%20Fred Weight 268\n",
      "Name: http://www.nfl.com/Leggett%2C%20Jordan Weight 250\n",
      "Name: http://www.nfl.com/Atkins%2C%20Bob Weight 215\n",
      "Name: http://www.nfl.com/Tatum%2C%20Malcolm Weight 250\n",
      "Name: http://www.nfl.com/Gonsoulin%2C%20Goose Weight 210\n",
      "Name: http://www.nfl.com/Feeney%2C%20Dan Weight 304\n",
      "Name: http://www.nfl.com/Dardar%2C%20Ramsey Weight 264\n",
      "Name: http://www.nfl.com/Thompson%2C%20Tim Weight 250\n",
      "Name: http://www.nfl.com/Noble%2C%20Mike Weight 220\n",
      "Name: http://www.nfl.com/Vardell%2C%20Tommy Weight 238\n",
      "Name: http://www.nfl.com/Davis%2C%20Andre Weight 330\n",
      "Name: http://www.nfl.com/DeVries%2C%20Jed Weight 300\n",
      "Name: http://www.nfl.com/Fitzgerald%2C%20Jeffrey Weight 280\n",
      "Name: http://www.nfl.com/Linne%2C%20Aubrey Weight 235\n",
      "Name: http://www.nfl.com/Parker%2C%20Arnold Weight 210\n",
      "Name: http://www.nfl.com/Lengel%2C%20Matt Weight 266\n",
      "Name: http://www.nfl.com/Trevathan%2C%20Danny Weight 239\n",
      "Name: http://www.nfl.com/Bell%2C%20Geno Weight 290\n",
      "Name: http://www.nfl.com/Dahlman%2C%20Neal Weight 240\n",
      "Name: http://www.nfl.com/Ankrah%2C%20Jason Weight 262\n",
      "Name: http://www.nfl.com/Floyd%2C%20Bobby%20Jack Weight 210\n",
      "Name: http://www.nfl.com/Walsh%2C%20Steve Weight 215\n",
      "Name: http://www.nfl.com/Ricard%2C%20Lester Weight 228\n"
     ]
    }
   ],
   "source": [
    "#query 3 -> Nome e peso de todos os jogadores com peso superior a 200\n",
    "qres = dados.query(\n",
    "    \"\"\"SELECT ?name ?weight\n",
    "       WHERE {\n",
    "          ?p a NFL:player .\n",
    "          ?p NFL:name ?name .\n",
    "          ?p NFL:weight ?weight .\n",
    "          FILTER (?weight > 200)\n",
    "       }LIMIT 50\"\"\")\n",
    "\n",
    "for row in qres:\n",
    "    print(\"Name: %s Weight %s\" % row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 333,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
